{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input20","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input20"},"inbound_nodes":[]},{"name":"dense_Dense59","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense59","trainable":true},"inbound_nodes":[[["input20",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization37","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization37","trainable":true},"inbound_nodes":[[["dense_Dense59",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU37","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU37","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization37",0,0,{}]]]},{"name":"dense_Dense60","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense60","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU37",0,0,{}]]]},{"name":"dense_Dense62","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense62","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU37",0,0,{}]]]},{"name":"dense_Dense64","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense64","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU37",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization38","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization38","trainable":true},"inbound_nodes":[[["dense_Dense60",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization39","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization39","trainable":true},"inbound_nodes":[[["dense_Dense62",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization40","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization40","trainable":true},"inbound_nodes":[[["dense_Dense64",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU38","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU38","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization38",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU39","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU39","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization39",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU40","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU40","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization40",0,0,{}]]]},{"name":"dense_Dense61","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense61","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU38",0,0,{}]]]},{"name":"dense_Dense63","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense63","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU39",0,0,{}]]]},{"name":"dense_Dense65","class_name":"Dense","config":{"units":864,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense65","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU40",0,0,{}]]]}],"input_layers":[["input20",0,0]],"output_layers":[["dense_Dense61",0,0],["dense_Dense63",0,0],["dense_Dense65",0,0]]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense59/kernel","shape":[2,512],"dtype":"float32"},{"name":"dense_Dense59/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense60/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense60/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense62/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense62/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense64/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense64/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense61/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense61/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense63/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense63/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense65/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense65/bias","shape":[864],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization37/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization38/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization39/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization40/moving_variance","shape":[512],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}