{"modelTopology":{"class_name":"Model","config":{"name":"decoder","layers":[{"name":"input12","class_name":"InputLayer","config":{"batch_input_shape":[null,2],"dtype":"float32","sparse":false,"name":"input12"},"inbound_nodes":[]},{"name":"dense_Dense33","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense33","trainable":true},"inbound_nodes":[[["input12",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization21","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization21","trainable":true},"inbound_nodes":[[["dense_Dense33",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU21","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU21","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization21",0,0,{}]]]},{"name":"dense_Dense34","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense34","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU21",0,0,{}]]]},{"name":"dense_Dense36","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense36","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU21",0,0,{}]]]},{"name":"dense_Dense38","class_name":"Dense","config":{"units":512,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense38","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU21",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization22","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization22","trainable":true},"inbound_nodes":[[["dense_Dense34",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization23","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization23","trainable":true},"inbound_nodes":[[["dense_Dense36",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization24","class_name":"BatchNormalization","config":{"axis":1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization24","trainable":true},"inbound_nodes":[[["dense_Dense38",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU22","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU22","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization22",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU23","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU23","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization23",0,0,{}]]]},{"name":"leaky_re_lu_LeakyReLU24","class_name":"LeakyReLU","config":{"alpha":0.3,"name":"leaky_re_lu_LeakyReLU24","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization24",0,0,{}]]]},{"name":"dense_Dense35","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense35","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU22",0,0,{}]]]},{"name":"dense_Dense37","class_name":"Dense","config":{"units":864,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense37","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU23",0,0,{}]]]},{"name":"dense_Dense39","class_name":"Dense","config":{"units":864,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense39","trainable":true},"inbound_nodes":[[["leaky_re_lu_LeakyReLU24",0,0,{}]]]}],"input_layers":[["input12",0,0]],"output_layers":[["dense_Dense35",0,0],["dense_Dense37",0,0],["dense_Dense39",0,0]]},"keras_version":"tfjs-layers 1.5.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense33/kernel","shape":[2,512],"dtype":"float32"},{"name":"dense_Dense33/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense34/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense34/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense36/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense36/bias","shape":[512],"dtype":"float32"},{"name":"dense_Dense38/kernel","shape":[512,512],"dtype":"float32"},{"name":"dense_Dense38/bias","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/beta","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/gamma","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/beta","shape":[512],"dtype":"float32"},{"name":"dense_Dense35/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense35/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense37/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense37/bias","shape":[864],"dtype":"float32"},{"name":"dense_Dense39/kernel","shape":[512,864],"dtype":"float32"},{"name":"dense_Dense39/bias","shape":[864],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization21/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization22/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization23/moving_variance","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_mean","shape":[512],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization24/moving_variance","shape":[512],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v1.5.2","convertedBy":null}